const handler = async (m, {conn}) => {
  m.reply(global.Buscarvsfem);
};
handler.command = /^(Buscarvsfem|buscarvsfem)$/i;
export default handler;
handler.admin = true
handler.group = true
handler.botAdmin = true

global.Buscarvsfem = ` 
╭──────────────────╮
│🫧 ⋆ ☇  𝗕𝗨𝗦𝗖𝗢 𝗩𝗦 𝗙𝗘𝗠 🧸
│
│      ›› 𝗛𝗼𝗿𝗮 ¦ 𝗠𝗼𝗱↷ 🧸
│🧸𝙈𝙤𝙙𝙖𝙡𝙞𝙙𝙖𝙙:
│⏰ 16 🇦🇷 ⌇ 14 🇵🇪
│🧸𝙈𝙤𝙙𝙖𝙡𝙞𝙙𝙖𝙙:
│⏰ 18 🇦🇷 ⌇ 16 🇵🇪
│🧸𝙈𝙤𝙙𝙖𝙡𝙞𝙙𝙖𝙙:
│⏰ 20 🇦🇷 ⌇ 18 🇵🇪
│🧸𝙈𝙤𝙙𝙖𝙡𝙞𝙙𝙖𝙙:
│⏰ 22 🇦🇷 ⌇ 20 🇵🇪 
│🧸𝙈𝙤𝙙𝙖𝙡𝙞𝙙𝙖𝙙:
│⏰ 00 🇦🇷 ⌇ 22 🇵🇪
╰──────────────────╯

⊹ ִֶָ 🫧Mis reglas, No modifico
⊹ ִֶָ 🫧Sin 🏳‍🌈 , Sin pc
⊹ ִֶָ 🫧Hablar con IG si o si.
⊹ ִֶָ 🫧Con logo en mano

🧸Hablar:🧸
wa.me/
wa.me/
`;