const handler = async (m, {conn}) => {
  m.reply(global.bsmixto);
};
handler.command = /^(bsmixto|buscarvsmixto)$/i;
export default handler;
handler.admin = true
handler.group = true
handler.botAdmin = true

global.bsmixto = `
╭──────────────────╮
│🫧𝘽𝙐𝙎𝘾𝙊 𝙑𝙎 𝙈𝙄𝙓𝙏𝙊🫧
│
│›› 𝗛𝗼𝗿𝗮 ¦ 𝗠𝗼𝗱↷📩
│ 
│🫧𝙈𝙤𝙙𝙖𝙡𝙞𝙙𝙖𝙙:
│⏰ 16 🇦🇷 ⌇ 14 🇵🇪
│🫧𝙈𝙤𝙙𝙖𝙡𝙞𝙙𝙖𝙙:
│⏰ 18 🇦🇷 ⌇ 16 🇵🇪
│🫧𝙈𝙤𝙙𝙖𝙡𝙞𝙙𝙖𝙙:
│⏰ 20 🇦🇷 ⌇ 18 🇵🇪
│🫧𝙈𝙤𝙙𝙖𝙡𝙞𝙙𝙖𝙙:
│⏰ 22 🇦🇷 ⌇ 20 🇵🇪 
│🫧𝙈𝙤𝙙𝙖𝙡𝙞𝙙𝙖𝙙:
│⏰ 00 🇦🇷 ⌇ 22 🇵🇪
╰──────────────────╯

⊹ ִֶָ  🌩️Mis reglas, No modifico
⊹ ִֶָ  🌩️1 🖥
⊹ ִֶָ  💌Hablar con IG si o si.
⊹ ִֶָ  💌Con logo en mano

🫧𝗛𝗮𝗯𝗹𝗮𝗿:🫧
wa.me/
wa.me/
`;