const handler = async (m, {conn}) => {
  m.reply(global.mapa);
};
handler.command = /^(Reglasmapa|reglasmapa)$/i;
export default handler;

global.mapa = `

*𝑹𝒆𝒈𝒍𝒂𝒔 𝑴𝒂𝒑𝒂 : 𝑫𝒀𝑳𝑨𝑵 𝑩𝑶𝑻*

𝑪𝒂𝒊𝒅𝒂 𝑪𝒂𝒎𝒃𝒊𝒂 𝑵𝒐𝒎𝒃𝒓𝒆 𝑫𝒆𝒍 𝑻𝒆𝒂𝒎
𝑹𝒆𝒃𝒆𝒍𝒔 1𝒓𝒂 𝑺𝒂𝒍𝒂 𝑳𝒂𝒅𝒐 𝑫𝒆𝒓𝒆𝒄𝒉𝒐
𝑹𝒊𝒗𝒂𝒍 2𝒅𝒂 𝑺𝒂𝒍𝒂 𝑳𝒂𝒅𝒐 𝑰𝒛𝒒𝒖𝒊𝒆𝒓𝒅𝒐

*𝑷𝒓𝒐𝒉𝒊𝒃𝒊𝒅𝒐*

𝑩𝒐𝒎𝒃𝒂𝒔 𝑬𝒙𝒑𝒍𝒐𝒔𝒊𝒗𝒂𝒔
𝑭𝒓𝒂𝒏𝒄𝒐 𝑬𝒙𝒆𝒄𝒑𝒕𝒐 𝑳𝒐𝒔 𝑫𝒆 𝑴𝒐𝒗𝒊𝒍
𝑴𝒊𝒏𝒂𝒔 , 𝑮𝒂𝒓𝒊𝒕𝒂𝒔 , 𝑮𝒓𝒂𝒏𝒂𝒅𝒂𝒔 , 𝑪𝒆𝒈𝒂𝒅𝒐𝒓𝒂𝒔
𝑨𝒖𝒕𝒐𝒔 , 𝑪𝒓7 , 𝑾𝒖𝒌𝒐𝒏 , 𝑺𝒌𝒚𝒍𝒆𝒓 , 𝑫𝒊𝒎𝒊𝒕𝒓𝒊

*𝑵𝒐𝒕𝒂*

𝑬𝒒𝒖𝒊𝒑𝒐 𝑸𝒖𝒆 𝑰𝒏𝒄𝒖𝒎𝒑𝒍𝒂 𝑨𝒍𝒈𝒖𝒏𝒂 𝑹𝒆𝒈𝒍𝒂 𝑨𝒖𝒕𝒐𝒎𝒂𝒕𝒊𝒄𝒂𝒎𝒆𝒏𝒕𝒆 𝑮𝒂𝒏𝒂 𝑬𝒍 𝑬𝒒𝒖𝒊𝒑𝒐 𝑪𝒐𝒏𝒕𝒓𝒂𝒓𝒊𝒐
𝑪𝒖𝒂𝒍𝒒𝒖𝒊𝒆𝒓 𝑹𝒆𝒄𝒍𝒂𝒎𝒐 𝑪𝒐𝒏 𝑽𝒊𝒅𝒆𝒐𝒔 𝑪𝒍𝒂𝒆𝒐𝒔 𝑶 𝑭𝒐𝒕𝒐𝒔
𝑺𝒊 𝑪𝒂𝒆 𝑳𝒂𝒅𝒐 𝑪𝒐𝒏𝒕𝒓𝒂𝒓𝒊𝒐 𝑺𝒆 𝑻𝒊𝒆𝒏𝒆 𝑸 𝑬𝒍𝒊𝒎𝒊𝒏𝒂𝒓

*𝑨𝒄𝒍𝒂𝒓𝒂𝒄𝒊𝒐𝒏𝒆𝒔*

10 𝑴𝒊𝒏 𝑫𝒆 𝑻𝒐𝒍𝒆𝒓𝒂𝒏𝒄𝒊𝒂 𝑫𝒆𝒔𝒑𝒖𝒆𝒔 𝑫𝒆 𝑷𝒂𝒔𝒂𝒓 𝑰𝒅 𝒀 𝑪𝒐𝒏𝒕𝒓𝒂𝒔𝒆ñ𝒂
𝑺𝒆 𝑴𝒂𝒕𝒂 𝑨𝒍 𝑴𝒂𝒓𝒄𝒂𝒓 1𝒓𝒂 𝒁𝒐𝒏𝒂
𝑴𝒂𝒙 1 𝑬𝒔𝒑𝒆𝒄 𝑷𝒐𝒓 𝑬𝒒𝒖𝒊𝒑𝒐 𝑳𝒂 𝑪𝒖𝒂𝒍 𝑺𝒐𝒍𝒐 𝑫𝒆𝒃𝒆𝒓𝒂 𝑽𝒆𝒓 𝑨 𝑺𝒖 𝑬𝒒𝒖𝒊𝒑𝒐
𝑺𝒊 𝑬𝒔 𝑻𝒆𝒂𝒎 2/4 - 3/6   - 4/8 - 6/12 𝑪𝒐𝒏 𝑻𝒂𝒈
𝑪𝒍𝒂𝒏 𝑻𝒐𝒅𝒐𝒔 𝑬𝒏 𝑬𝒍 𝑴𝒊𝒔𝒎𝒐

*𝑽𝒆𝒔𝒕𝒊𝒎𝒆𝒏𝒕𝒂*

𝑹𝒆𝒃𝒆𝒍𝒔 : 𝑵𝒆𝒈𝒓𝒐
𝑹𝒊𝒗𝒂𝒍 : 𝑩𝒍𝒂𝒏𝒄𝒐

*𝑪𝒓𝒆𝒂𝒄𝒊𝒐𝒏*

1𝒓𝒂 𝑺𝒂𝒍𝒂 : 𝑹𝒊𝒗𝒂𝒍
2𝒅𝒂 𝑺𝒂𝒍𝒂 : 𝑹𝒆𝒃𝒆𝒍𝒔
3𝒓𝒂 𝑺𝒂𝒍𝒂 : 𝑷𝒆𝒓𝒅𝒆𝒅𝒐𝒓 𝑫𝒆 1𝒓𝒂


*𝑩𝒚 : 𝑫𝒚𝒍𝒂𝒏 𝑩𝒐𝒕*
`;